In [2]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('database.sqlite')

query = "SELECT * FROM sqlite_master"

df_schema = pd.read_sql_query(query, conn)

df_schema.tbl_name.unique()

array(['sqlite_sequence', 'Player_Attributes', 'Player', 'Match',
       'League', 'Country', 'Team', 'Team_Attributes'], dtype=object)

<br>

#### 1. Which team scored the most points when playing at home?

In [60]:
query = """

SELECT team_long_name, CAST(SUM(home_team_goal) AS INT) as Home_Goals
FROM Match
LEFT JOIN Team 
ON Match.home_team_api_id = Team.team_api_id
GROUP BY team_long_name;"""

home_goals = pd.read_sql_query(query, conn)
home_goals.sort_values(by = 'Home_Goals', ascending = False, inplace = True)

home_goals.head(1)

     team_long_name  Home_Goals
211  Real Madrid CF         505

##### Answer: Real Madrid CF

<br>

#### 2. Did this team also score the most points when playing away?

In [65]:
query = """
SELECT team_long_name, CAST(SUM(away_team_goal) AS INT) as Away_Goals
FROM Match
LEFT JOIN Team 
ON Match.away_team_api_id = Team.team_api_id
GROUP BY team_long_name;"""

away_goals = pd.read_sql_query(query, conn)
away_goals.sort_values(by = 'Away_Goals', ascending = False, inplace = True)

away_goals.head(1)

   team_long_name  Away_Goals
75   FC Barcelona         354

##### Answer: No, FC Barcelona scored the most points when playing away

<br>

#### 3. How many matches resulted in a tie?

In [75]:
query = """

WITH Ties AS (
    SELECT home_team_goal, away_team_goal
    FROM Match
    WHERE home_team_goal = away_team_goal
)

SELECT COUNT(*) AS Tie_Count
FROM Ties;
"""

tie_games = pd.read_sql_query(query, conn)
tie_games

   Tie_Count
0       6596

##### Answer: There were 6596 ties

<br>

#### 4. How many players have Smith for their last name? How many have 'smith' anywhere in their name?

In [151]:
query = """

    SELECT
    SUM(SUBSTR(player_name, -6) = ' Smith') AS smith_last_name
    , SUM(player_name LIKE '%SMITH%') AS smith_name_anywhere
    FROM Player


;
"""

smith = pd.read_sql_query(query, conn)
smith

   smith_last_name  smith_name_anywhere
0               15                   18

##### Answer: 15 Players have the last name Smith, 18 Players have 'smith' anywhere in their name

<br>

#### 5. What was the median tie score? Use the value determined in the previous question for the number of tie games.

In [10]:
query = """

WITH Ties AS (
    SELECT home_team_goal, away_team_goal, RANK() OVER (ORDER BY home_team_goal) AS Rank,
    COUNT(*) as Row_Count
    FROM Match
    WHERE home_team_goal = away_team_goal
)
, fifty_percent AS (
    SELECT home_team_goal as score
    FROM Ties
    WHERE Rank <= (Row_Count/2) + 1
)

SELECT MAX(score) as median_tie_score
FROM fifty_percent
;
"""

tie_games_median = pd.read_sql_query(query, conn)
tie_games

   median_tie_score
0                 1

##### The median tie score is 1.

<br>

#### 6. What percentage of players prefer their left or right foot?

In [74]:
query = """

SELECT 
CAST(SUM(preferred_foot = 'right') AS FLOAT)/ COUNT(*) AS Percent_Right
, (CAST(SUM(preferred_foot = 'left') AS FLOAT)/ COUNT(*)) AS Percent_Left
FROM Player_Attributes;
"""

right_left = pd.read_sql_query(query, conn)
right_left

   Percent_Right  Percent_Left
0       0.752313      0.243143

##### Answer: 75.23% of players prefer their right foot, 24.31% of players prefer their left foot. The rest didn't put a preference